etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/BF/BLE/ESP32_BLE/Esp32_Ble_Api.cpp
/**
 *****************************************************************************************
 *	@file		Esp32_Ble_Api.cpp
 *	@details    See header file for  overview.
 *	@copyright  2021 Eaton Corporation. All Rights Reserved.
 *
 *****************************************************************************************
 */

#include "Esp32_Ble_Api.h"
#include "StdLib_MV.h"
///< Stack files
#include "Ble_Defines.h"
#include "BLE_DCI_DATA.h"
#include "Ble_DCI.h"
#include "Ble_User_Management.h"
#include "DCI_Owner.h"
#include "BLE_Debug.h"
#include "Ble_Api.h"
#include "Single_LED.h"
extern uint8_t ble_state;
Ble_Api* Ble_Api::m_ble_api_obj = nullptr;
int32_t Ble_Api::m_event_mapping_gap[] = { 0 };
int32_t Ble_Api::m_event_mapping_gatts[] = { 0 };


#ifdef CONFIG_BT_ENABLED
/*
 *
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
Esp32_Ble_Api::Esp32_Ble_Api( Ble_Advertisement* ble_adv, Ble_DCI* ble_dci, Ble_User_Management* ble_user_mgmt,
							  Single_LED* ble_led ) :
	m_ble_adv( ble_adv ),
	m_ble_dci( ble_dci ),
	m_ble_led( ble_led ),
	m_ble_user_mgmt( ble_user_mgmt )
{
	m_ble_api_obj = this;
	m_ble_display = ble_led;
	Ble_Init();
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Ble_Api::Ble_Init()
{
	uint32_t map_index = 0;
	int32_t m_Event_Mapping_Gatts_Esp[GATTS_MAX_EVENT] =
	{
		ESP_GATTS_CREAT_ATTR_TAB_EVT,
		ESP_GATTS_CONNECT_EVT,
		ESP_GATTS_DISCONNECT_EVT,
		ESP_GATTS_READ_EVT,
		ESP_GATTS_WRITE_EVT,
		ESP_GATTS_RESPONSE_EVT,
		ESP_GATTS_RESPONSE_EVT,
		ESP_GATTS_REG_EVT,
	};

	int32_t m_Event_Mapping_Gap_Esp[GAP_MAX_EVENT] =
	{
		-1,		/// Event not applicable for ESP32
		ESP_GAP_BLE_SCAN_RSP_DATA_SET_COMPLETE_EVT,
		-1,		/// Event not applicable for ESP32
		ESP_GAP_BLE_SEC_REQ_EVT,
		ESP_GAP_BLE_PASSKEY_REQ_EVT,
		ESP_GAP_BLE_OOB_REQ_EVT,
		ESP_GAP_BLE_NC_REQ_EVT,
		ESP_GAP_BLE_AUTH_CMPL_EVT,
		-1,		/// Event not applicable for ESP32
		-1,		/// Event not applicable for ESP32
		ESP_GAP_BLE_REMOVE_BOND_DEV_COMPLETE_EVT
	};

	for ( map_index = 0; map_index < GAP_MAX_EVENT; map_index++ )
	{
		m_event_mapping_gap[map_index] = m_Event_Mapping_Gap_Esp[map_index];
	}
	for ( map_index = 0; map_index < GATTS_MAX_EVENT; map_index++ )
	{
		m_event_mapping_gatts[map_index] = m_Event_Mapping_Gatts_Esp[map_index];
	}

	m_ble_api_obj->Init_Configuration();

	m_ble_api_obj->Register_Callbacks();

	m_ble_api_obj->Ble_Led_Display_Control();

	m_ble_api_obj->Security_Configure();

	m_ble_api_obj->Config_Adv_Data();

	m_ble_api_obj->Config_Raw_Adv_Data();

}

/*
 *****************************************************************************************
 *  See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Ble_Api::Init_Configuration( void )
{
	esp_err_t ret;
	esp_bt_controller_config_t bt_cfg = BT_CONTROLLER_INIT_CONFIG_DEFAULT();
	uint16_t serv_idx = 0;

	ESP_ERROR_CHECK( esp_bt_controller_mem_release( ESP_BT_MODE_CLASSIC_BT ) );
	ret = esp_bt_controller_init( &bt_cfg );

	if ( ret )
	{
		BLE_DEBUG_PRINT( DBG_MSG_ERROR, "%s initialize controller failed: %s\n",  __func__, esp_err_to_name( ret ) );
		return;
	}
	ret = esp_bt_controller_enable( ESP_BT_MODE_BLE );

	if ( ret )
	{
		BLE_DEBUG_PRINT( DBG_MSG_ERROR, "%s enable controller failed: %s\n",  __func__, esp_err_to_name( ret ) );
		return;
	}
	ret = esp_bluedroid_init();

	if ( ret )
	{
		BLE_DEBUG_PRINT( DBG_MSG_ERROR, "%s  init bluetooth failed: %s\n",  __func__, esp_err_to_name( ret ) );
		return;
	}
	ret = esp_bluedroid_enable();

	if ( ret )
	{
		BLE_DEBUG_PRINT( DBG_MSG_ERROR, "%s  enable bluetooth failed: %s\n",  __func__, esp_err_to_name( ret ) );
		return;
	}

	///< Init gatts_if with ESP_GATT_IF_NONE for each service before register the services
	for ( serv_idx = 0; serv_idx < TOTAL_SERVICE; serv_idx++ )
	{
		gatts_profile_tab[serv_idx].gatts_if = ESP_GATT_IF_NONE;
	}
}

/*
 *****************************************************************************************
 *  See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Ble_Api::Config_Raw_Adv_Data( void )
{
	struct advt_data_struct_t
	{
		uint8_t advt_data_len;
		uint8_t advt_data[31];
	};

	advt_data_struct_t advertisement_data_struct = { 0U, 0U };

	advertisement_data_struct.advt_data_len = m_ble_adv->Get_Full_Packet( advertisement_data_struct.advt_data );
	esp_err_t raw_adv_ret =
		esp_ble_gap_config_adv_data_raw( ( uint8_t* )( advertisement_data_struct.advt_data ),
										 ( uint32_t )advertisement_data_struct.advt_data_len );

	if ( raw_adv_ret )
	{
		BLE_DEBUG_PRINT( DBG_MSG_ERROR, "config raw adv data failed, error code = %x ",  raw_adv_ret );
	}

}

/*
 *****************************************************************************************
 *  See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Ble_Api::Register_Callbacks( void )
{
	esp_err_t ret = ESP_FAIL;

	ret = esp_ble_gatts_register_callback( ( esp_gatts_cb_t ) ( Ble_Event_Handler1 ) );

	if ( ret )
	{
		BLE_DEBUG_PRINT( DBG_MSG_ERROR, "gatts register error, error code = %x",   ret );
	}
	else
	{
		ret = esp_ble_gap_register_callback( ( esp_gap_ble_cb_t ) Ble_Event_Handler2 );

		if ( ret )
		{
			BLE_DEBUG_PRINT( DBG_MSG_ERROR, "gap register error, error code = %x",   ret );
		}
	}

	if ( ret )
	{
		return;
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Ble_Api::Config_Adv_Data( void )
{
	esp_err_t ret;
	config_data_struct_t adv_data;
	static DCI_Owner* m_min_conn_interval_owner = nullptr;
	static DCI_Owner* m_max_conn_interval_owner = nullptr;

	adv_data.set_scan_rsp = true;
	adv_data.include_name = true;
	adv_data.include_txpower = true;
	m_min_conn_interval_owner = new DCI_Owner( DCI_BLE_MIN_VAL_CONN_INTERVAL_DCID );
	m_min_conn_interval_owner->Check_Out( adv_data.min_interval );
	m_max_conn_interval_owner = new DCI_Owner( DCI_BLE_MAX_VAL_CONN_INTERVAL_DCID );
	m_max_conn_interval_owner->Check_Out( adv_data.max_interval );
	adv_data.appearance = 0x00;
	adv_data.manufacturer_len = 0;			/// TEST_MANUFACTURER_DATA_LEN,
	adv_data.p_manufacturer_data = NULL;	/// &test_manufacturer[0],
	adv_data.service_data_len = 0;
	adv_data.p_service_data = NULL;
	adv_data.service_uuid_len = sizeof( sec_service_uuid );
	adv_data.p_service_uuid = sec_service_uuid;
	adv_data.flag = ( ESP_BLE_ADV_FLAG_GEN_DISC | ESP_BLE_ADV_FLAG_BREDR_NOT_SPT );
	esp_ble_adv_data_t* config_data = ( esp_ble_adv_data_t* )( &adv_data );

	ret = esp_ble_gap_config_adv_data( config_data );

	if ( ret )
	{
		BLE_DEBUG_PRINT( DBG_MSG_ERROR, "config adv data failed, error code = %x",   ret );
		ble_state = BLE_FAULT;
	}

