etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/BF/BLE/ESP32_BLE/Esp32_Ble_Api.cpp
}

/*
 *****************************************************************************************
 *  See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Ble_Api::Start_Advertising( void* advertisement_data )
{
	const uint8_t ACCESS_INVALID = 0xFF;
	uint8_t active_access_level = ACCESS_INVALID;

	esp_ble_gap_start_advertising( &esp32_adv_config_params );

	active_access_level = m_ble_user_mgmt->Get_Active_Access_Level();
	BLE_DEBUG_PRINT( DBG_MSG_INFO, "Start_Advertising ,ACTIVE ACCESS LEVEL:%d\n", active_access_level );

}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Ble_Api::Security_Configure( void )
{
	esp_err_t ret;
	uint16_t serv_idx = 0;
	uint32_t passkey = 0U;
	static DCI_Owner* m_passkey_update_owner = nullptr;

	///< set the security iocap & auth_req & key size & init key response key parameters to the stack
	esp_ble_auth_req_t auth_req = ESP_LE_AUTH_REQ_SC_MITM_BOND;		/// bonding with peer device after
	// authentication
	/// esp_ble_io_cap_t iocap = ESP_IO_CAP_IO; ///ESP_IO_CAP_NONE;                 /// set the IO capability to No
	/// output No input
	esp_ble_io_cap_t iocap = ESP_IO_CAP_OUT;
	uint8_t key_size = 16;											/// the key size should be 7~16 bytes
	uint8_t init_key = ESP_BLE_ENC_KEY_MASK | ESP_BLE_ID_KEY_MASK;
	uint8_t rsp_key = ESP_BLE_ENC_KEY_MASK | ESP_BLE_ID_KEY_MASK;

	m_passkey_update_owner = new DCI_Owner( DCI_BLE_DEVICE_PASSKEY_DCID );
	m_passkey_update_owner->Check_Out( passkey );
	uint8_t auth_option = ESP_BLE_ONLY_ACCEPT_SPECIFIED_AUTH_ENABLE;
	uint8_t oob_support = ESP_BLE_OOB_DISABLE;

	esp_ble_gap_set_security_param( ESP_BLE_SM_SET_STATIC_PASSKEY, &passkey, sizeof( uint32_t ) );
	esp_ble_gap_set_security_param( ESP_BLE_SM_AUTHEN_REQ_MODE, &auth_req, sizeof( uint8_t ) );
	esp_ble_gap_set_security_param( ESP_BLE_SM_IOCAP_MODE, &iocap, sizeof( uint8_t ) );
	esp_ble_gap_set_security_param( ESP_BLE_SM_MAX_KEY_SIZE, &key_size, sizeof( uint8_t ) );
	esp_ble_gap_set_security_param( ESP_BLE_SM_ONLY_ACCEPT_SPECIFIED_SEC_AUTH, &auth_option, sizeof( uint8_t ) );
	esp_ble_gap_set_security_param( ESP_BLE_SM_OOB_SUPPORT, &oob_support, sizeof( uint8_t ) );
	esp_ble_gap_set_security_param( ESP_BLE_SM_SET_INIT_KEY, &init_key, sizeof( uint8_t ) );
	esp_ble_gap_set_security_param( ESP_BLE_SM_SET_RSP_KEY, &rsp_key, sizeof( uint8_t ) );

	///< Register application identifier for each service
	for ( serv_idx = 0; serv_idx < TOTAL_SERVICE; serv_idx++ )
	{
		ret = esp_ble_gatts_app_register( serv_idx );
		if ( ret )
		{
			BLE_DEBUG_PRINT( DBG_MSG_ERROR, "gatts app register error, error code = %x", ret );
			ble_state = BLE_ATTENTION;
			return;
		}
		BLE_DEBUG_PRINT( DBG_MSG_INFO, "gatts app register for service ID = %d", serv_idx );
	}

	esp_ble_gap_set_device_name( TEST_DEVICE_NAME );
	esp_ble_gap_config_local_privacy( true );
	ble_state = BLE_PAIRING;

}

/*
 *****************************************************************************************
 *  See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Ble_Api::Set_Encryption( void* param1 )
{
	esp_ble_gatts_cb_param_t* param = ( esp_ble_gatts_cb_param_t* )( param1 );

	BLE_DEBUG_PRINT( DBG_MSG_DEBUG, "Starting security connect event with peer device" );
	///< start security connect with peer device when receive the connect event sent by the master
	esp_ble_set_encryption( param->connect.remote_bda, ESP_BLE_SEC_ENCRYPT_MITM );
	ble_state = BLE_CONNECTED;
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Ble_Api::Set_Bondable_Mode( void* bondable_mode_param )
{
	bondable_mode_param_t* bondable_mode_param_ptr = reinterpret_cast<bondable_mode_param_t*>
		( bondable_mode_param );
	uint16_t* dev_num = bondable_mode_param_ptr->dev_num;
	esp_ble_bond_dev_t* dev_list = bondable_mode_param_ptr->dev_list;

	esp_ble_get_bond_device_list( ( int* ) dev_num, dev_list );
}

/*
 *****************************************************************************************
 *  See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Ble_Api::Connection_Parameter( void* connection_param )
{
	esp_bd_addr_t bd_addr;

	connection_param_struct_t* connection_param_ptr = reinterpret_cast<connection_param_struct_t*>
		( connection_param );
	esp_ble_conn_update_params_t* params = connection_param_ptr->params;

	memcpy( bd_addr, connection_param_ptr->bd_addr, sizeof( esp_bd_addr_t ) );
	uint16_t min_conn_interval = connection_param_ptr->min_interval;
	uint16_t max_conn_interval = connection_param_ptr->max_interval;
	uint16_t slave_latency = connection_param_ptr->latency;
	uint16_t supervision_tout = connection_param_ptr->timeout;

	esp_ble_gap_update_conn_params( params );
	esp_ble_gap_set_prefer_conn_params( bd_addr, min_conn_interval, max_conn_interval, slave_latency,
										supervision_tout );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Ble_Api::Read_Response( void* read_response_data )
{
	BLE_DEBUG_PRINT( DBG_MSG_DEBUG, "Read Response\n" );
	ble_state = BLE_POLLING;
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Ble_Api::Write_Response( void* write_response_data )
{
	BLE_DEBUG_PRINT( DBG_MSG_DEBUG, "Write Response\n" );
	ble_state = BLE_POLLING;
}

