etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/BF/BLE/ESP32_BLE/Esp32_Ble_Api.cpp
/*
 *****************************************************************************************
 *  See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Ble_Api::Gatts_Create_Attr_Table( int gatts_if, void* param )
{
	esp_gatt_if_t esp_gatts_if = ( esp_gatt_if_t )( gatts_if );
	uint16_t serv_id = 0U;

	esp_ble_gatts_cb_param_t* esp_param =
		( esp_ble_gatts_cb_param_t* ) ( param );

	///< If event is register event, store the gatts_if for each profile
	if ( esp_param->reg.status == ESP_GATT_OK )
	{
		gatts_profile_tab[esp_param->reg.app_id].gatts_if = esp_gatts_if;
	}
	else
	{
		BLE_DEBUG_PRINT( DBG_MSG_INFO, "Reg app failed, app_id %04x, status %d\n",
						 esp_param->reg.app_id, esp_param->reg.status );
		return;
	}

	///< Find the Service ID from gatts_if
	serv_id = Find_Service_Id_From_Gatt_If( esp_gatts_if );

	///< Create the service and Characteristics using attribute table */
	esp_ble_gatts_create_attr_tab(
		esp_gatts_attrib_db[serv_id].attrib_tbl, esp_gatts_if,
		esp_gatts_attrib_db[serv_id].total_attrib, serv_id );
	BLE_DEBUG_PRINT( DBG_MSG_ERROR, "Attribute table created for Service %d\n",
					 serv_id );
}

/*
 *****************************************************************************************
 * Gatts_start_service.
 *****************************************************************************************
 */
void Esp32_Ble_Api::Gatts_Start_Service( int32_t gatts_if, void* param )
{
	esp_gatt_if_t esp_gatts_if = ( esp_gatt_if_t )( gatts_if );
	uint16_t serv_id = Find_Service_Id_From_Gatt_If( esp_gatts_if );
	esp_ble_gatts_cb_param_t* esp_param =
		( esp_ble_gatts_cb_param_t* ) ( param );
	uint16_t attri_idx = 0;

	BLE_DEBUG_PRINT( DBG_MSG_INFO, "[Gatts_Start_Service] gatts_if = %x\n,The number handle = %x",
					 esp_gatts_if, esp_param->add_attr_tab.num_handle );
	if ( esp_param->create.status == ESP_GATT_OK )
	{
		if ( esp_param->add_attr_tab.num_handle ==
			 esp_gatts_attrib_db[serv_id].total_attrib )
		{
			///< Copied/Saved the Handle table generated by esp into local table
			memcpy( gatts_profile_tab[serv_id].attrib_handle_tbl,
					esp_param->add_attr_tab.handles,
					( esp_param->add_attr_tab.num_handle
					  * sizeof( attribute_handle ) ) );
			for ( attri_idx = 0;
				  attri_idx < esp_param->add_attr_tab.num_handle;
				  attri_idx++ )
			{
				BLE_DEBUG_PRINT(
					DBG_MSG_INFO, "Handle = %d\n",
					gatts_profile_tab[serv_id].attrib_handle_tbl[attri_idx] );
			}
			///< Start the GATTS service using service handle number
			esp_ble_gatts_start_service(
				gatts_profile_tab[serv_id].attrib_handle_tbl[0] );			/// Here 0 index point to Service Attribute
		}
		else
		{
			BLE_DEBUG_PRINT( DBG_MSG_INFO,
							 "Create attribute table abnormally, num_handle (%d) doesn't equal to Service(%d)'s Total Attributes(%d)",
							 esp_param->add_attr_tab.num_handle, serv_id,
							 esp_gatts_attrib_db[serv_id].total_attrib );
		}
	}
	else
	{
		BLE_DEBUG_PRINT( DBG_MSG_ERROR, " Create attribute table failed, error code = %x",
						 esp_param->create.status );
	}
}

/*
 *****************************************************************************************
 * Read_Event
 *****************************************************************************************
 */
void Esp32_Ble_Api::Read_Event( int32_t gatts_if, void* param )
{
	esp_gatt_if_t esp_gatts_if = ( esp_gatt_if_t ) ( gatts_if );
	esp_ble_gatts_cb_param_t* esp_param = ( esp_ble_gatts_cb_param_t* ) ( param );
	esp_gatt_status_t esp_gatt_status = ESP_GATT_OK;
	esp_err_t response_err = ESP_OK;
	esp_gatt_rsp_t rsp;
	uint16_t rsp_attr_value_index = 0;
	uint16_t dest_data_read_index = 0;
	uint8_t* dest_data_ptr = dest_data_read;
	///< DCI handle variables
	Ble_DCI::CHAR_ID_TD ble_unique_id = 0U;
	const uint8_t ACCESS_INVALID = 0xFF;
	uint8_t active_access_level = ACCESS_INVALID;
	const uint8_t NO_ACCESS = 0;
	DCI_ID_TD dcid = 0U;
	uint8_t read_access = 0U;
	uint8_t write_access = 0U;
	DCI_ERROR_TD dci_error = DCI_ERR_NO_ERROR;
	static DCI_LENGTH_TD full_length = 0U;	/// retaining the length
	DCI_LENGTH_TD length = 0U;

	ble_state = BLE_POLLING;
	uint16_t ble_unique_id_each_par = 0U;
	uint8_t group_index_count = 0U, index = 0U;
	uint8_t group_assem_check = false;

	///< Fetching the current access level of the user
	active_access_level = m_ble_user_mgmt->Get_Active_Access_Level();
	BLE_DEBUG_PRINT( DBG_MSG_INFO, "Read_Event : gatts_if %d, Read Handle = %d offset = %d \n",
					 esp_gatts_if, esp_param->read.handle, esp_param->read.offset );

	ble_unique_id = ( Ble_DCI::CHAR_ID_TD ) esp_param->read.handle;
	BLE_DEBUG_PRINT( DBG_MSG_INFO, " Ble_unique_id = %d \n", ble_unique_id );

	if ( ble_unique_id >= ( m_ble_dci->m_group_profile->ble_dci_group_struct[0].group_dcid ) )
	{
		group_index_count =
			( ( ble_unique_id - ( m_ble_dci->m_group_profile->ble_dci_group_struct[0].group_dcid ) ) / 2U );

		///< This condition will cross verify the ble_unique_id and group_dcid are same or not.
		if ( m_ble_dci->m_group_profile->ble_dci_group_struct[group_index_count].group_dcid == ble_unique_id )
		{
			group_assem_check = true;

			/* This loop will run till the total parameters inside the assembly/group
			   taken from the structure based on the group index count.*/
			for ( int i = 0;
				  i < m_ble_dci->m_group_profile->ble_dci_group_struct[group_index_count].total_parameters;
				  i++ )
			{
				ble_unique_id_each_par =
					m_ble_dci->m_group_profile->ble_dci_group_struct[group_index_count].ble_dcid[i];
				BLE_DEBUG_PRINT( DBG_MSG_INFO, "ble_unique_id_each_par is =%d\r\n", ble_unique_id_each_par );
				dcid = m_ble_dci->Find_Ble_Mod_DCID( ble_unique_id_each_par, &read_access, &write_access );
				BLE_DEBUG_PRINT( DBG_MSG_INFO, "Read Access level %d\r\n", read_access );
				if ( dcid != DCI_ID_UNDEFINED )
				{
					if ( ( ( read_access != NO_ACCESS ) && ( read_access != ACCESS_INVALID ) ) &&
						 ( active_access_level >= read_access ) )
					{
						dci_error = m_ble_dci->Get_Dcid_Data( dcid, reinterpret_cast<DCI_LENGTH_TD*>( &length ),
															  reinterpret_cast<uint8_t*>( m_ble_dci->
																						  m_individual_readvalue ) );
						BLE_DEBUG_PRINT( DBG_MSG_INFO, "DCID is = %d,Access level %d\r\n", dcid,
										 active_access_level );
						if ( dci_error != DCI_ERR_NO_ERROR )
						{
							BLE_DEBUG_PRINT( DBG_MSG_DEBUG, "Read Access Not Permitted\r\n" );
							dci_error = DCI_ERR_NO_ERROR;
						}
						else
						{
							BF_Lib::Copy_String( dest_data_ptr + index, m_ble_dci->m_individual_readvalue, length );
							index += length;

