etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/BF/BLE/ESP32_BLE/Esp32_Ble_Api.cpp
						}
					}
					else
					{
						BLE_DEBUG_PRINT( DBG_MSG_INFO,
										 "Current Access level is %d\n\rRead Access Not Permitted for current access level\n",
										 active_access_level );
						dci_error = DCI_ERR_ACCESS_VIOLATION;
					}
				}
				else
				{
					BLE_DEBUG_PRINT( DBG_MSG_INFO, "DCID is invalid\n" );
					dci_error = DCI_ERR_INVALID_DATA_ID;
				}
			}
		}
		else
		{
			dci_error = DCI_ERR_INVALID_DATA_ID;

		}
	}
	else
	{
		if ( esp_param->read.offset == 0U )
		{
			///< If offset is zero means Read Event comes first time, then get data from DCI

			ble_unique_id = ( Ble_DCI::CHAR_ID_TD ) esp_param->read.handle;
			///< Get the DCID from CHAR_ID
			dcid = m_ble_dci->Find_Ble_Mod_DCID( ble_unique_id, &read_access, &write_access );
			BLE_DEBUG_PRINT( DBG_MSG_INFO, "Active access level is %d and Read Access level is %d\r\n",
							 active_access_level, read_access );
			if ( dcid == DCI_ID_UNDEFINED )
			{
				BLE_DEBUG_PRINT( DBG_MSG_ERROR, "Read_Event : Find_Ble_Mod_DCID : Error Undefined dcid %d\n", dcid );
				esp_gatt_status = ESP_GATT_NOT_FOUND;
			}
			else
			{
				BLE_DEBUG_PRINT( DBG_MSG_INFO, "Read_Event : Find_Ble_Mod_DCID : dcid %d\n", dcid );
				///< Clear the data buffer
				memset( dest_data_read, 0, BLE_ADV_BUF_MAX_SIZE );
				///< Read Data from DCI using DCID into data buffer
				if ( ( ( read_access != NO_ACCESS ) && ( read_access != ACCESS_INVALID ) ) &&
					 ( active_access_level >= read_access ) )
				{
					dci_error = m_ble_dci->Get_Dcid_Data( dcid, &length, dest_data_read );
					if ( dci_error != DCI_ERR_NO_ERROR )
					{
						BLE_DEBUG_PRINT( DBG_MSG_DEBUG, "Read Access Not Permitted\r\n" );
						BLE_DEBUG_PRINT( DBG_MSG_ERROR, "Read_Event : Error while Get_Dcid_Data %d\n", dci_error );
						esp_gatt_status = Interpret_Ble_Error( m_ble_dci->Interpret_DCI_Error( dci_error ) );
					}
					else
					{
						/* Save the DCID data length into static variable full_length for sending data into chunk if
						   data is
						   long. */
						full_length = length;
						BLE_DEBUG_PRINT( DBG_MSG_INFO, "Read_Event : Get_Dcid_Data : length  %d\n", length );
					}
				}
				else
				{
					BLE_DEBUG_PRINT( DBG_MSG_DEBUG, "Read Access Not Permitted\r\nAccess level %d\r\n",
									 active_access_level );
					dci_error = DCI_ERR_ACCESS_VIOLATION;
				}
			}
		}
		else
		{
			///< If Offset is non-zero means Read Event comes for sending data into multiple chunks

			if ( esp_param->read.offset >= full_length )
			{
				///< error detected in offset calculation.
				BLE_DEBUG_PRINT( DBG_MSG_ERROR, "Read_Event : error detected in offset calculation\n" );
				esp_gatt_status = ESP_GATT_INVALID_OFFSET;
			}
			else
			{
				length = full_length - esp_param->read.offset;
			}

		}
	}
	///< Prepare the GATT remote read request response
	memset( &rsp, 0, sizeof( esp_gatt_rsp_t ) );
	rsp.attr_value.handle = esp_param->read.handle;

	///< If no error then copied data from data buffer into esp
	if ( esp_gatt_status == ESP_GATT_OK )
	{
		rsp.attr_value.len = length;

		///< Compare length with GATT maximum attribute length
		if ( length > ESP_GATT_MAX_ATTR_LEN )
		{
			length = ESP_GATT_MAX_ATTR_LEN;
		}

		if ( group_assem_check == true )
		{
			dest_data_read_index = index;
			for ( rsp_attr_value_index = 0; rsp_attr_value_index < dest_data_read_index; rsp_attr_value_index++ )
			{
				rsp.attr_value.value[rsp_attr_value_index] = dest_data_read[rsp_attr_value_index];
				BLE_DEBUG_PRINT( DBG_MSG_INFO, "response attr value is = %d\r\n",
								 rsp.attr_value.value[rsp_attr_value_index] );
			}

		}
		else
		{
			///< Copy data into Read Request Response attribute value buffer
			for ( rsp_attr_value_index = 0, dest_data_read_index = esp_param->read.offset;
				  rsp_attr_value_index < length; rsp_attr_value_index++, dest_data_read_index++ )
			{
				rsp.attr_value.value[rsp_attr_value_index] =
					dest_data_read[dest_data_read_index];
				BLE_DEBUG_PRINT( DBG_MSG_INFO, "response attr value is = %d\r\n",
								 rsp.attr_value.value[rsp_attr_value_index] );
			}
		}
	}

	/* Sent prepared GATT remote Read Request Response */
	response_err = esp_ble_gatts_send_response( esp_gatts_if, esp_param->read.conn_id,
												esp_param->read.trans_id, esp_gatt_status,
												&rsp );
	if ( response_err != ESP_OK )
	{
		BLE_DEBUG_PRINT( DBG_MSG_ERROR, "Read_Event: Send gatts response error\n" );
	}
}

/*
 *****************************************************************************************
 * Write_Event
 *****************************************************************************************
 */
void Esp32_Ble_Api::Write_Event( int32_t gatts_if, void* param )
{
	esp_gatt_if_t esp_gatts_if = ( esp_gatt_if_t ) ( gatts_if );
	esp_ble_gatts_cb_param_t* esp_param = ( esp_ble_gatts_cb_param_t* ) ( param );
	esp_gatt_status_t esp_gatt_status = ESP_GATT_OK;
	esp_err_t response_err = ESP_OK;
	esp_gatt_rsp_t rsp;
	static uint16_t full_length = 0U;	/// retaining the length

	const uint8_t ACCESS_INVALID = 0xFF;
	uint8_t active_access_level = ACCESS_INVALID;
	const uint8_t NO_ACCESS = 0;

	///< DCI handle variables
	DCI_ID_TD dcid = 0U;
	Ble_DCI::CHAR_ID_TD ble_unique_id = ( Ble_DCI::CHAR_ID_TD ) esp_param->write.handle;
	uint8_t read_access;
	uint8_t write_access;
	DCI_ERROR_TD dci_error = DCI_ERR_NO_ERROR;

	ble_state = BLE_POLLING;
	///< Fetching the current access level of the user
	active_access_level = m_ble_user_mgmt->Get_Active_Access_Level();
	BLE_DEBUG_PRINT( DBG_MSG_INFO, "Write_Event : gatts_if %d, Read Handle = %d offset = %d \n", esp_gatts_if,
					 esp_param->write.handle, esp_param->write.offset );
	BLE_DEBUG_PRINT( DBG_MSG_DEBUG, "conn_id:%d, trans_id:%d, handle: %d, offset:%d, need_rsp:%d, is_prep:%d, len:%d\n",
					 esp_param->write.conn_id, esp_param->write.trans_id, esp_param->write.handle,
					 esp_param->write.offset, esp_param->write.need_rsp, esp_param->write.is_prep,
					 esp_param->write.len );
	///< Check offset value validation
	if ( esp_param->write.offset > BLE_ADV_BUF_MAX_SIZE )
	{
		BLE_DEBUG_PRINT( DBG_MSG_INFO, "Write_Event: ESP_GATT_INVALID_OFFSET\n" );
		esp_gatt_status = ESP_GATT_INVALID_OFFSET;
	}
	else if ( ( esp_param->write.offset + esp_param->write.len ) > BLE_ADV_BUF_MAX_SIZE )
	{
		BLE_DEBUG_PRINT( DBG_MSG_INFO, "Write_Event: ESP_GATT_INVALID_ATTR_LEN\n" );
		esp_gatt_status = ESP_GATT_INVALID_ATTR_LEN;
	}

	if ( esp_param->write.need_rsp )
	{
		if ( esp_param->write.is_prep )
		{
			/// TODO: Fix this Implement this case from gatts_demo.c example
			rsp.attr_value.len = esp_param->write.len;
			rsp.attr_value.handle = esp_param->write.handle;
			rsp.attr_value.offset = esp_param->write.offset;
			rsp.attr_value.auth_req = ESP_GATT_AUTH_REQ_NONE;
			memcpy( rsp.attr_value.value, esp_param->write.value, esp_param->write.len );
			if ( esp_gatt_status != ESP_GATT_OK )
			{
				///< Clear the data buffer
				memset( dest_data_read, 0, BLE_ADV_BUF_MAX_SIZE );
				///< Copy the data from ESP BLE to data buffer
				memcpy( dest_data_read + esp_param->write.offset, esp_param->write.value,
						esp_param->write.len );
				///< Update the full_length with ESP param length
				full_length += esp_param->write.len;
			}

			///< Sent prepared GATT remote Read Request Response
			response_err = esp_ble_gatts_send_response( esp_gatts_if, esp_param->write.conn_id,
														esp_param->write.trans_id,
														esp_gatt_status, &rsp );
			if ( response_err != ESP_OK )
			{
				BLE_DEBUG_PRINT( DBG_MSG_ERROR, "Write_Event: Send response error\n" );
			}
		}
		else
		{
			///< Write data into DCI data.
			///< Clear the data buffer
			memset( dest_data_read, 0, BLE_ADV_BUF_MAX_SIZE );
			///< Copy the data from ESP BLE to data buffer
			memcpy( dest_data_read + esp_param->write.offset, esp_param->write.value,
					esp_param->write.len );

			///< Get the DCID from CHAR_ID
			dcid = m_ble_dci->Find_Ble_Mod_DCID( ble_unique_id, &read_access, &write_access );
			BLE_DEBUG_PRINT( DBG_MSG_INFO, "Active access level %d\r\nWrite access level %d\r\n", active_access_level,
							 write_access );
			if ( dcid == DCI_ID_UNDEFINED )
			{
				BLE_DEBUG_PRINT( DBG_MSG_ERROR, "Write_Event : Find_Ble_Mod_DCID : Error Undefined dcid %d\n", dcid );
				esp_gatt_status = ESP_GATT_NOT_FOUND;
			}
			else
			{
				BLE_DEBUG_PRINT( DBG_MSG_INFO, "Write_Event : Find_Ble_Mod_DCID : dcid %d\n", dcid );
				if ( ( ( write_access != NO_ACCESS ) && ( write_access != ACCESS_INVALID ) ) &&
					 ( active_access_level >= write_access ) )
				{
					///< Get the DCI DATA length
					full_length = m_ble_dci->Get_Length( dcid );

					///< Write buffer data to DCI using Set_Dcid_Data api
					dci_error = m_ble_dci->Set_Dcid_Data( dcid, full_length, dest_data_read );
					if ( dci_error != DCI_ERR_NO_ERROR )
					{
						BLE_DEBUG_PRINT( DBG_MSG_ERROR, "Write_Event : Error while Set_Dcid_Data %d\n",
										 dci_error );
						esp_gatt_status = Interpret_Ble_Error( m_ble_dci->Interpret_DCI_Error( dci_error ) );
					}
					full_length = 0;
				}
				else
				{
					BLE_DEBUG_PRINT( DBG_MSG_INFO, "Write Access Not Permitted\n" );
				}

