etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/BF/BLE/ESP32_BLE/Esp32_Ble_Api.cpp
				esp_ble_gatts_send_response( esp_gatts_if, esp_param->write.conn_id,
											 esp_param->write.trans_id, esp_gatt_status, NULL );
				if ( response_err != ESP_OK )
				{
					BLE_DEBUG_PRINT( DBG_MSG_ERROR, "Write_Event: Send response error\n" );
				}
			}
		}
	}
}

/*
 *****************************************************************************************
 *  See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Ble_Api::Authentication_Complete( void* param1 )
{
	esp_bd_addr_t bd_addr;
	esp_ble_gap_cb_param_t* param = ( esp_ble_gap_cb_param_t* )( param1 );

	memcpy( bd_addr, param->ble_security.auth_cmpl.bd_addr, sizeof( esp_bd_addr_t ) );
	BLE_DEBUG_PRINT( DBG_MSG_INFO, "remote BD_ADDR: %08x%04x,address type = %d,pair status = %s\n", \
					 ( bd_addr[0] << 24 ) + ( bd_addr[1] << 16 ) + ( bd_addr[2] << 8 ) + bd_addr[3],
					 ( bd_addr[4] << 8 ) + bd_addr[5], param->ble_security.auth_cmpl.addr_type,
					 param->ble_security.auth_cmpl.success ? "success" : "fail" );

	if ( !param->ble_security.auth_cmpl.success )
	{
		BLE_DEBUG_PRINT( DBG_MSG_INFO, "fail reason = 0x%x", param->ble_security.auth_cmpl.fail_reason );
		ble_state = BLE_ATTENTION;
	}
	else
	{
		BLE_DEBUG_PRINT( DBG_MSG_INFO, "auth mode = %s",
						 Esp_Auth_Req_To_Str( param->ble_security.auth_cmpl.auth_mode ) );
	}
	ble_state = BLE_PAIRING;
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
char* Esp32_Ble_Api::Esp_Auth_Req_To_Str( esp_ble_auth_req_t auth_req )
{
	char* auth_str = NULL;

	switch ( auth_req )
	{
		case ESP_LE_AUTH_NO_BOND:
			auth_str = ( char* ) "ESP_LE_AUTH_NO_BOND";
			break;

		case ESP_LE_AUTH_BOND:
			auth_str = ( char* ) "ESP_LE_AUTH_BOND";
			break;

		case ESP_LE_AUTH_REQ_MITM:
			auth_str = ( char* ) "ESP_LE_AUTH_REQ_MITM";
			break;

		case ESP_LE_AUTH_REQ_BOND_MITM:
			auth_str = ( char* ) "ESP_LE_AUTH_REQ_BOND_MITM";
			break;

		case ESP_LE_AUTH_REQ_SC_ONLY:
			auth_str = ( char* ) "ESP_LE_AUTH_REQ_SC_ONLY";
			break;

		case ESP_LE_AUTH_REQ_SC_BOND:
			auth_str = ( char* ) "ESP_LE_AUTH_REQ_SC_BOND";
			break;

		case ESP_LE_AUTH_REQ_SC_MITM:
			auth_str = ( char* ) "ESP_LE_AUTH_REQ_SC_MITM";
			break;

		case ESP_LE_AUTH_REQ_SC_MITM_BOND:
			auth_str = ( char* ) "ESP_LE_AUTH_REQ_SC_MITM_BOND";
			break;

		default:
			auth_str = ( char* ) "INVALID BLE AUTH REQ";
			break;
	}
	return ( auth_str );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
uint16_t Esp32_Ble_Api::Find_Service_Id_From_Gatt_If(
	esp_gatt_if_t gatts_if )
{
	uint16_t serv_index = 0;

	for ( serv_index = 0; serv_index < TOTAL_SERVICE; serv_index++ )
	{
		if ( gatts_profile_tab[serv_index].gatts_if == gatts_if )
		{
			return ( serv_index );
		}
	}
	return ( 0 );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
esp_gatt_status_t Esp32_Ble_Api::Interpret_Ble_Error( uint8_t ble_error )
{
	esp_gatt_status_t return_esp_gatt_status;

	switch ( ble_error )
	{
		case BLE_NO_ERROR_CODE:
			return_esp_gatt_status = ESP_GATT_OK;
			break;

		case BLE_EXCEEDS_RANGE_ERROR_CODE:
			return_esp_gatt_status = ESP_GATT_OUT_OF_RANGE;
			break;

		case BLE_OTHER_DCID_ERROR_CODE:
			return_esp_gatt_status = ESP_GATT_UNKNOWN_ERROR;
			break;

		case BLE_INVALID_DATA_LENGTH_ERROR_CODE:
			return_esp_gatt_status = ESP_GATT_INVALID_ATTR_LEN;
			break;

		case BLE_INVALID_COMMAND_ERROR_CODE:
			return_esp_gatt_status = ESP_GATT_ILLEGAL_PARAMETER;
			break;

		case BLE_RAM_READ_ONLY_ERROR_CODE:
			return_esp_gatt_status = ESP_GATT_WRITE_NOT_PERMIT;
			break;

		case BLE_NV_READ_ONLY_ERROR_CODE:
			return_esp_gatt_status = ESP_GATT_WRITE_NOT_PERMIT;
			break;

		case BLE_NV_ACCESS_FAILURE_ERROR_CODE:
			return_esp_gatt_status = ESP_GATT_BUSY;
			break;

		case BLE_ACCESS_VIOLATION_ERROR_CODE:
			return_esp_gatt_status = ESP_GATT_ILLEGAL_PARAMETER;
			break;

		case BLE_NV_NOT_AVAILABLE_ERROR_CODE:
			return_esp_gatt_status = ESP_GATT_NOT_FOUND;
			break;

		case BLE_DEFAULT_NOT_AVAILABLE_ERROR_CODE:
			return_esp_gatt_status = ESP_GATT_NOT_FOUND;
			break;

		case BLE_RANGE_NOT_AVAILABLE_ERROR_CODE:
			return_esp_gatt_status = ESP_GATT_OUT_OF_RANGE;
			break;

		case BLE_ENUM_NOT_AVAILABLE_ERROR_CODE:
			return_esp_gatt_status = ESP_GATT_NOT_FOUND;
			break;

		case BLE_VALUE_LOCKED_ERROR_CODE:
			return_esp_gatt_status = ESP_GATT_AUTH_FAIL;
			break;

		case BLE_TOTAL_ERRORS_ERROR_CODE:
			return_esp_gatt_status = ESP_GATT_UNKNOWN_ERROR;
			break;

		case BLE_INVALID_DATA_ID_ERROR_CODE:
			return_esp_gatt_status = ESP_GATT_ILLEGAL_PARAMETER;
			break;

		default:
			return_esp_gatt_status = ESP_GATT_UNKNOWN_ERROR;
			break;
	}

	return ( return_esp_gatt_status );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Ble_Api::Ble_Led_Display_Control( void )
{

	if ( m_ble_display != nullptr )
	{
		switch ( ble_state )
		{
			case BLE_IDLE_OR_DISCONNECTED:
				m_ble_display->Device_Disconnected();
				break;

			case BLE_PAIRING:
				m_ble_display->Pairing_Mode();
				break;

			case BLE_CONNECTED:
				m_ble_display->Device_Connected();
				break;

			case BLE_POLLING:
				m_ble_display->Data_Operations();
				break;

			case BLE_FAULT:
				m_ble_display->Device_Faulted();
				break;

			case BLE_ATTENTION:
				m_ble_display->Attention();
				break;
		}
	}
}

#endif	// #ifdef CONFIG_BT_ENABLED
